---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeCreaseArray.Item(System.Int32)
source: html/ebf5b4ff-a6ad-00b6-2d7b-67f4dd80f708.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual SlabShapeCrease this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.